{
    "alpha": 32,
    "auto_mapping": null,
    "base_model_name_or_path": "wxjiao/alpaca-7b",
    "bias": "none",
    "fan_in_fan_out": false,
    "inference_mode": true,
    "init_lora_weights": true,
    "layers_pattern": null,
    "layers_to_transform": null,
    "lora_dropout": 0.1,
    "modules_to_save": null,
    "peft_type": "LORA",
    "r": 16,
    "revision": null,
    "target_modules": [
      "q_proj",
      "v_proj", 
      "k_proj",
      "o_proj"
    ],
    "task_type": "CAUSAL_LM",
    "veterinary_specific": {
      "snomed_integration": true,
      "hierarchical_loss": false,
      "multi_label_classification": true,
      "species_aware": true,
      "clinical_terminology": "veterinary_medical"
    }
  }
  